Revit 2026 API

# BeamSystemBeamSystemType Property

---

Retrieves or changes the type of the BeamSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BeamSystemType BeamSystemType { get; set; }
```
```vb
Public Property BeamSystemType As BeamSystemType
	Get
	Set
```
```cpp
public:
property BeamSystemType^ BeamSystemType {
	BeamSystemType^ get ();
	void set (BeamSystemType^ value);
}
```
```fsharp
member BeamSystemType : BeamSystemType with get, set
```

#### Property Value

BeamSystemType

#### Reference

BeamSystem Class

Autodesk.Revit.DB Namespace